// Создать программу которая выдает частное 2-х чисел
double a = 12; // double - вещественное число 
double b = 5;
Console.WriteLine(a / b);